{
  "type": 3,
  "content": {
    "version": "KqlItem/1.0",
    "query": "// Step 1: Create a fun name pool to use as aliases\nlet FunNames = datatable(HashedID:int, Alias:string)\n[\n    1, \"Alex\", 2, \"Bailey\", 3, \"Cameron\", 4, \"Drew\", 5, \"Emery\",\n    6, \"Finn\", 7, \"Gabby\", 8, \"Harper\", 9, \"Indie\", 10, \"Jules\",\n    11, \"Kai\", 12, \"Logan\", 13, \"Morgan\", 14, \"Nova\", 15, \"Oakley\",\n    16, \"Peyton\", 17, \"Quinn\", 18, \"Riley\", 19, \"Sky\", 20, \"Tate\",\n    21, \"Uma\", 22, \"Vince\", 23, \"Wren\", 24, \"Xan\", 25, \"Yuki\",\n    26, \"Zion\", 27, \"River\", 28, \"Sage\", 29, \"Blair\", 30, \"Reese\",\n    31, \"Avery\", 32, \"Blake\", 33, \"Casey\", 34, \"Dakota\", 35, \"Elliot\",\n    36, \"Frankie\", 37, \"Gray\", 38, \"Hollis\", 39, \"Isley\", 40, \"Jamie\",\n    41, \"Kendall\", 42, \"Lane\", 43, \"Marley\", 44, \"Nico\", 45, \"Onyx\",\n    46, \"Presley\", 47, \"Quest\", 48, \"Reagan\", 49, \"Skyler\", 50, \"Toni\",\n    51, \"Uriah\", 52, \"Vesper\", 53, \"Winter\", 54, \"Xavi\", 55, \"Yael\",\n    56, \"Zuri\", 57, \"Ash\", 58, \"Briar\", 59, \"Cleo\", 60, \"Denim\",\n    61, \"Echo\", 62, \"Flint\", 63, \"Gem\", 64, \"Hero\", 65, \"Ivory\",\n    66, \"Jett\", 67, \"Koa\", 68, \"Lux\", 69, \"Monroe\", 70, \"Navy\",\n    71, \"Ocean\", 72, \"Poet\", 73, \"Roux\", 74, \"Scout\", 75, \"True\",\n    76, \"Vale\", 77, \"West\", 78, \"Zephyr\", 79, \"Arrow\", 80, \"Brook\",\n    81, \"Clove\", 82, \"Drift\", 83, \"Ever\", 84, \"Fable\", 85, \"Grove\",\n    86, \"Harbor\", 87, \"Indigo\", 88, \"Jasper\", 89, \"Kit\", 90, \"Lark\",\n    91, \"Mica\", 92, \"Noa\", 93, \"Orion\", 94, \"Pax\", 95, \"Quill\",\n    96, \"Rain\", 97, \"Sol\", 98, \"Tali\", 99, \"Umber\", 100, \"Vail\"\n];\n\n// Step 2: Assign unique & consistent alias to each Caller + CallerIpAddress combo\nlet CallerAliasMap = AzureActivity\n| where isnotempty(Caller) and isnotempty(CallerIpAddress)\n| summarize by Caller, CallerIpAddress\n| extend CallerKey = strcat(Caller, \"-\", CallerIpAddress)\n| extend HashedID = abs(hash(CallerKey)) % 100 + 1\n| join kind=leftouter (FunNames) on HashedID;\n\n// Step 3: Filter & enrich activity log with geo + aliases\nlet GeoIPDB_FULL = _GetWatchlist(\"geoip\");\n\nAzureActivity\n| where not(Caller matches regex @\"^[{(]?[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}[)}]?$\")\n| where CallerIpAddress matches regex @\"\\b(?:[0-9]{1,3}\\.){3}[0-9]{1,3}\\b\"\n| where OperationNameValue endswith \"WRITE\" and (ActivityStatusValue == \"Success\" or ActivityStatusValue == \"Succeeded\")\n| summarize ResourceCreationCount = count() by Caller, CallerIpAddress\n| join kind=leftouter (CallerAliasMap) on Caller, CallerIpAddress\n| evaluate ipv4_lookup(GeoIPDB_FULL, CallerIpAddress, network)\n| extend DebugAlias = Alias\n| extend DisplayName = iif(isnull(DebugAlias), \"Unknown\", DebugAlias)\n| project \n    DisplayName, \n    CallerIpAddress, \n    ResourceCreationCount, \n    Country = countryname, \n    Latitude = latitude, \n    Longitude = longitude, \n    friendly_label = strcat(DisplayName, \" - \", cityname, \", \", countryname)",
    "size": 3,
    "timeContext": {
      "durationMs": 2592000000
    },
    "queryType": 0,
    "resourceType": "microsoft.operationalinsights/workspaces",
    "visualization": "map",
    "mapSettings": {
      "locInfo": "LatLong",
      "latitude": "Latitude",
      "longitude": "Longitude",
      "sizeSettings": "ResourceCreationCount",
      "sizeAggregation": "Sum",
      "labelSettings": "friendly_label",
      "legendMetric": "ResourceCreationCount",
      "legendAggregation": "Sum",
      "itemColorSettings": {
        "nodeColorField": "ResourceCreationCount",
        "colorAggregation": "Sum",
        "type": "heatmap",
        "heatmapPalette": "greenRed"
      }
    }
  },
  "name": "Randomized Caller Activity Map"
}
